Autodesk.Revit.DB.PointClouds.PointIterator.Free
Completes lifetime of the iterator.  Call it when done using the iterator.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointIterator.Reset
Resets the iterator to the beginning of the collection.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointIterator.IsDone
Identifies if the iteration has reached the end of the collection.
Returns:
True if the iteration has reached the end, false otherwise.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointIterator.MoveNext
Increments the iterator to the next point in the collection.
Returns:
True if there is another available point in this iterator.
False if the iterator has completed all available points.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointIterator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointIterator
A class used to iterate individual points in a PointCollection.
Remarks:
Points may be iterated in two different ways:
In the traditional IEnumerable interface, you can iterate the resulting points directly from the PointCollection.In an unsafe interface usable only from C# and C++/CLI, you can get a pointer to the point storage of the collection and access the points directly in memory.
Although you must deal with pointers directly, there may be performance improvements when traversing large buffers of points.
Regardless of the approach used to obtain the points, the points are reported in the coordinate system of the point cloud.  If you need the
points in the coordinate system of the model, you will need to transform the point in those coordinates.  The most direct way to do this
is to obtain the transformation matrix from the PointCloudInstance (GetTransform()), convert the CloudPoint to an XYZ
using the implicit conversion operator, and use Transform.OfPoint(XYZ).
Since:
2012